# ClearLoops Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionData..::..ClearLoops Method
IFCExtrusionData Class See Also
---
Clears the curve loops stored in the extrusion data.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void ClearLoops()
```

Visual Basic
---
```text
Public Sub ClearLoops
```

Visual C++
---
```text
public:
void ClearLoops()
```

# See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace